src/Reports/ОтчётПоРасходуВПроизводствоСоСреднейЦеной/ОтчётПоРасходуВПроизводствоСоСреднейЦеной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоРасходуВПроизводствоСоСреднейЦеной</name>
</mdclass:Report>

src/AccumulationRegisters/ПередачиВПроизводство/ПередачиВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиВПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ЦеныСредние/ЦеныСредние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныСредние</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ВыпускПродукцииКанбан/ВыпускПродукцииКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииКанбан</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поступление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПередачаВПроизводство/ПередачаВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаВПроизводство</name>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапСпецификации</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчётПоРасходуВПроизводствоСоСреднейЦеной/Forms/ФормаОтчета/Module.bsl
&НаСервере  
Функция ПолучитьЛинейкуКанбан(ВидКанбана)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛинейкиВидыКанбанов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Линейки.ВидыКанбанов КАК ЛинейкиВидыКанбанов
	|ГДЕ
	|	ЛинейкиВидыКанбанов.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ЛинейкиВидыКанбанов.ВидКанбана = &ВидКанбана";
Запрос.УстановитьПараметр("ВидКанбана", ВидКанбана);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(Неопределено);
КонецФункции
 
&НаСервере            
Функция ПолучитьЛинейкуПоПоследнемуВыпуску(Изделие)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыпускПродукцииКанбан.ДокументОснование.Линейка КАК Линейка
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.Изделие = &Изделие
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыпускПродукцииКанбан.Дата УБЫВ";
Запрос.УстановитьПараметр("Изделие",Изделие);		
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
	Возврат(ВыборкаДетальныхЗаписей.Линейка.Родитель);
	КонецЦикла;
Возврат(Неопределено);
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
Запрос = Новый Запрос;
СписокДок = Новый СписокЗначений;
СписокВидовМПЗ = Новый СписокЗначений;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблИзделие = Макет.ПолучитьОбласть("Изделие");
ОблВидМПЗ = Макет.ПолучитьОбласть("ВидМПЗ");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");	
ОблКонец = Макет.ПолучитьОбласть("Конец");	

ОблШапка.Параметры.ДатаНач = Формат(Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

	Если ВидыМПЗ = 0 Тогда
	СписокВидовМПЗ.Добавить(Перечисления.ВидыМПЗ.Материалы);	
	СписокВидовМПЗ.Добавить(Перечисления.ВидыМПЗ.Полуфабрикаты);
	ИначеЕсли ВидыМПЗ = 1 Тогда
	СписокВидовМПЗ.Добавить(Перечисления.ВидыМПЗ.Материалы);
	ИначеЕсли ВидыМПЗ = 2 Тогда	
	СписокВидовМПЗ.Добавить(Перечисления.ВидыМПЗ.Полуфабрикаты);	
	КонецЕсли;
		Если ВидОтчёта = 0 Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыпускПродукции.ДокументОснование.Изделие КАК Изделие,
			|	ВыпускПродукции.ДокументОснование.Количество КАК Количество,
			|	ВыпускПродукции.ДокументОснование КАК ДокументОснование
			|ИЗ
			|	Документ.ВыпускПродукции КАК ВыпускПродукции
			|ГДЕ
			|	ВыпускПродукции.НаСклад = ИСТИНА
			|	И ВыпускПродукции.Дата МЕЖДУ &ДатаНач И &ДатаКон";		
		Иначе	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыпускПродукции.Изделие КАК Изделие,
			|	ВыпускПродукции.Количество КАК Количество,
			|	ВыпускПродукции.ДокументОснование.ДокументОснование КАК ДокументОснование
			|ИЗ
			|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукции
			|ГДЕ
			|	ВыпускПродукции.Дата МЕЖДУ &ДатаНач И &ДатаКон";		
		КонецЕсли;
			Если СписокПодразделений.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И ВыпускПродукции.Подразделение В ИЕРАРХИИ(&СписокПодразделений)";	
			Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);		
			КонецЕсли;
				Если СписокЛинеек.Количество() > 0 Тогда
				Запрос.Текст = Запрос.Текст + " И ВыпускПродукции.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)";	
				Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);		
				КонецЕсли;
					Если СписокНоменклатуры.Количество() > 0 Тогда
					Запрос.Текст = Запрос.Текст + " И ВыпускПродукции.ДокументОснование.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";	
					Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);		
					КонецЕсли;
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	ВыпускПродукции.ДокументОснование.Изделие.Товар.Наименование
								|ИТОГИ
								|	СУММА(Количество)
								|ПО
								|	Изделие";
Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаИзделие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИзделие.Следующий() Цикл 
	СуммаРасходИтого = 0;
   	ЦенаЗаШтукуИтого = 0;
	ВыборкаДетальныеЗаписи = ВыборкаИзделие.Выбрать();
	СписокДок.Очистить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДок.Добавить(ВыборкаДетальныеЗаписи.ДокументОснование);
		КонецЦикла;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачиВПроизводствоОбороты.ВидМПЗ КАК ВидМПЗ,
		|	ПередачиВПроизводствоОбороты.МПЗ КАК МПЗ,
		|	ПередачиВПроизводствоОбороты.КоличествоПриход КАК КоличествоПриход
		|ИЗ
		|	РегистрНакопления.ПередачиВПроизводство.Обороты(, , Регистратор, ) КАК ПередачиВПроизводствоОбороты
		|ГДЕ
		|	ПередачиВПроизводствоОбороты.Документ В(&СписокДок)
		|	И ТИПЗНАЧЕНИЯ(ПередачиВПроизводствоОбороты.Регистратор) = ТИП(Документ.ПередачаВПроизводство)
		|   И ПередачиВПроизводствоОбороты.ВидМПЗ В (&СписокВидовМПЗ)";
	Запрос.Текст = Запрос.Текст + "  УПОРЯДОЧИТЬ ПО ПередачиВПроизводствоОбороты.ВидМПЗ, 
									|	ПередачиВПроизводствоОбороты.МПЗ.Наименование
									|ИТОГИ
									|	СУММА(КоличествоПриход)
									|ПО
									|	ВидМПЗ,
									|	МПЗ";
	Запрос.УстановитьПараметр("СписокДок", СписокДок);
	Запрос.УстановитьПараметр("СписокВидовМПЗ", СписокВидовМПЗ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаВидМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидМПЗ.Следующий() Цикл
		ВыборкаМПЗ = ВыборкаВидМПЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаМПЗ.Следующий() Цикл
			РЦС = РегистрыСведений.ЦеныСредние.ПолучитьПоследнее(Период.ДатаОкончания,Новый Структура("МПЗ",ВыборкаМПЗ.МПЗ)); 
			СуммаРасход = ВыборкаМПЗ.КоличествоПриход*РЦС.Цена;
			ЦенаЗаШтуку = СуммаРасход/ВыборкаИзделие.Количество;
			СуммаРасходИтого = СуммаРасходИтого + СуммаРасход;
		   	ЦенаЗаШтукуИтого = ЦенаЗаШтукуИтого + ЦенаЗаШтуку;
			КонецЦикла;
		КонецЦикла;
	ОблИзделие.Параметры.Наименование = СокрЛП(ВыборкаИзделие.Изделие.Наименование);
	ОблИзделие.Параметры.Изделие = ВыборкаИзделие.Изделие; 
	ОблИзделие.Параметры.ЕдиницаИзмерения = СокрЛП(ВыборкаИзделие.Изделие.ЕдиницаИзмерения.Наименование);
	ОблИзделие.Параметры.Количество = ВыборкаИзделие.Количество;
	ОблИзделие.Параметры.СуммаРасход = СуммаРасходИтого;
	ОблИзделие.Параметры.ЦенаЗаШтуку = ЦенаЗаШтукуИтого;  
		Если Не ВыборкаИзделие.Изделие.Канбан.Пустая() Тогда
		ОблИзделие.Параметры.ВидКанбана = СокрЛП(ВыборкаИзделие.Изделие.Канбан.Наименование);
		ЛинейкаКанбан = СписокДок[0].Значение.Линейка;
		ОблИзделие.Параметры.ГруппаЛинеек = СокрЛП(ЛинейкаКанбан.Родитель.Наименование);		
		ОблИзделие.Параметры.Подразделение = СокрЛП(ЛинейкаКанбан.Подразделение.Наименование);
		Иначе	
		ОблИзделие.Параметры.ВидКанбана = "";
		ОблИзделие.Параметры.Подразделение = СокрЛП(ВыборкаИзделие.Изделие.Линейка.Подразделение.Наименование);
		ОблИзделие.Параметры.ГруппаЛинеек = "";
		КонецЕсли;
			Если Не ВыборкаИзделие.Изделие.Товар.Пустая() Тогда
			ОблИзделие.Параметры.ГруппаЛинеек = СокрЛП(ВыборкаИзделие.Изделие.Линейка.Родитель.Наименование);		
			КонецЕсли;
	ТабДок.Вывести(ОблИзделие);
	ТабДок.НачатьГруппуСтрок("Изделие",Истина);	
	ВыборкаВидМПЗ.Сбросить();
		Пока ВыборкаВидМПЗ.Следующий() Цикл
		ОблВидМПЗ.Параметры.ВидМПЗ = ВыборкаВидМПЗ.ВидМПЗ;
		ТабДок.Вывести(ОблВидМПЗ);
		ТабДок.НачатьГруппуСтрок("ВидМПЗ",Истина);	
		ВыборкаМПЗ = ВыборкаВидМПЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаМПЗ.Следующий() Цикл
			ОблМПЗ.Параметры.Наименование = СокрЛП(ВыборкаМПЗ.МПЗ.Наименование);
			ОблМПЗ.Параметры.МПЗ = ВыборкаМПЗ.МПЗ; 
			ОблМПЗ.Параметры.ЕдиницаИзмерения = СокрЛП(ВыборкаМПЗ.МПЗ.ЕдиницаИзмерения.Наименование);
			ОблМПЗ.Параметры.Количество = ВыборкаМПЗ.КоличествоПриход;
			ОблМПЗ.Параметры.Норма = ВыборкаМПЗ.КоличествоПриход/ВыборкаИзделие.Количество;
			РЦС = РегистрыСведений.ЦеныСредние.ПолучитьПоследнее(Период.ДатаОкончания,Новый Структура("МПЗ",ВыборкаМПЗ.МПЗ));
			ОблМПЗ.Параметры.Цена = РЦС.Цена; 
			ОблМПЗ.Параметры.СуммаРасход = ВыборкаМПЗ.КоличествоПриход*РЦС.Цена;
			ОблМПЗ.Параметры.ЦенаЗаШтуку = ОблМПЗ.Параметры.СуммаРасход/ВыборкаИзделие.Количество;
				Если ТипЗнч(ВыборкаМПЗ.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда 
					Если Не ВыборкаМПЗ.МПЗ.Канбан.Пустая() Тогда
					ОблМПЗ.Параметры.ВидКанбана = СокрЛП(ВыборкаМПЗ.МПЗ.Канбан.Наименование);
					ГруппаЛинеек = ПолучитьЛинейкуПоПоследнемуВыпуску(ВыборкаМПЗ.МПЗ);
						Если ГруппаЛинеек <> Неопределено Тогда
						ОблМПЗ.Параметры.ГруппаЛинеек = СокрЛП(ГруппаЛинеек.Наименование);
						ОблМПЗ.Параметры.Подразделение = СокрЛП(ГруппаЛинеек.Подразделение.Наименование);
						Иначе	
						ОблМПЗ.Параметры.Подразделение = ""; 
						ОблМПЗ.Параметры.ГруппаЛинеек = "";						
						КонецЕсли;
					Иначе
 					ОблМПЗ.Параметры.ВидКанбана = "";
					ОблМПЗ.Параметры.Подразделение = ""; 
					ОблМПЗ.Параметры.ГруппаЛинеек = "";
					КонецЕсли;
				Иначе
 				ОблМПЗ.Параметры.ВидКанбана = "";
				ОблМПЗ.Параметры.Подразделение = "";
				ОблМПЗ.Параметры.ГруппаЛинеек = "";				
				КонецЕсли;
			ТабДок.Вывести(ОблМПЗ);
			КонецЦикла;
		ТабДок.ЗакончитьГруппуСтрок();
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла; 
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
ТабДок.ФиксацияСлева = 1;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НастройкиНаСервере()
Настройки = Новый Структура;
Настройки.Вставить("ВидОтчёта",ВидОтчёта);
Настройки.Вставить("ВидыМПЗ",ВидыМПЗ);
Настройки.Вставить("СписокЛинеек",СписокЛинеек);
Настройки.Вставить("СписокНоменклатуры",СписокНоменклатуры);
Настройки.Вставить("СписокПодразделений",СписокПодразделений);
Возврат(Новый Структура("КлючНазначенияИспользования,Настройки","ОтчётПоРасходуВПроизводствоСоСреднейЦеной",Настройки));
КонецФункции

&НаКлиенте
Процедура Настройки(Команда)
Результат = ОткрытьФормуМодально("ОбщаяФорма.НастройкиФорм",НастройкиНаСервере());
	Если Результат <> Неопределено Тогда	
	ВидОтчёта = Результат.ВидОтчёта;
	ВидыМПЗ = Результат.ВидыМПЗ;
	СписокЛинеек = Результат.СписокЛинеек;
	СписокНоменклатуры = Результат.СписокНоменклатуры;
	СписокПодразделений = Результат.СписокПодразделений;
	КонецЕсли;
КонецПроцедуры
